<script setup lang="ts">
// // import { color } from "../composables/useColor"

// console.log("test")
// // const useColor =  useState<string>('color', () => 'pink')
// // console.log(useState('color').value);
// // console.log(color);

// console.log(useColor())
</script>

<template>
  <FirstView />
  <div class="h-96">
    <p>
      これはテキストエリアですこれはテキストエリアですこれはテキストエリアですこれはテキストエリアですこれはテキストエリアですこれはテキストエリアですこれはテキストエリアですこれはテキストエリアですこれはテキストエリアですこれはテキストエリアですこれはテキストエリアですこれはテキストエリアですこれはテキストエリアですこれはテキストエリアですこれはテキストエリアですこれはテキストエリアですこれはテキストエリアですこれはテキストエリアですこれはテキストエリアですこれはテキストエリアですこれはテキストエリアですこれはテキストエリアですこれはテキストエリアですこれはテキストエリアです
    </p>
  </div>
  <div class="h-96">
    <p>
      これはテキストエリアですこれはテキストエリアですこれはテキストエリアですこれはテキストエリアですこれはテキストエリアですこれはテキストエリアですこれはテキストエリアですこれはテキストエリアですこれはテキストエリアですこれはテキストエリアですこれはテキストエリアですこれはテキストエリアですこれはテキストエリアですこれはテキストエリアですこれはテキストエリアですこれはテキストエリアですこれはテキストエリアですこれはテキストエリアですこれはテキストエリアですこれはテキストエリアですこれはテキストエリアですこれはテキストエリアですこれはテキストエリアですこれはテキストエリアです
    </p>
  </div>
  <div class="h-96">
    <p>
      これはテキストエリアですこれはテキストエリアですこれはテキストエリアですこれはテキストエリアですこれはテキストエリアですこれはテキストエリアですこれはテキストエリアですこれはテキストエリアですこれはテキストエリアですこれはテキストエリアですこれはテキストエリアですこれはテキストエリアですこれはテキストエリアですこれはテキストエリアですこれはテキストエリアですこれはテキストエリアですこれはテキストエリアですこれはテキストエリアですこれはテキストエリアですこれはテキストエリアですこれはテキストエリアですこれはテキストエリアですこれはテキストエリアですこれはテキストエリアです
    </p>
  </div>
  <div class="h-96">
    <p>
      これはテキストエリアですこれはテキストエリアですこれはテキストエリアですこれはテキストエリアですこれはテキストエリアですこれはテキストエリアですこれはテキストエリアですこれはテキストエリアですこれはテキストエリアですこれはテキストエリアですこれはテキストエリアですこれはテキストエリアですこれはテキストエリアですこれはテキストエリアですこれはテキストエリアですこれはテキストエリアですこれはテキストエリアですこれはテキストエリアですこれはテキストエリアですこれはテキストエリアですこれはテキストエリアですこれはテキストエリアですこれはテキストエリアですこれはテキストエリアです
    </p>
  </div>
</template>

<style lang="scss" scoped>
// /* ヘッダーのスタイル */
// header {
//   background-color: #333; /* モノトーンの背景色 */
//   color: #fff; /* テキストの色 */
//   padding: 20px;
//   display: flex;
//   justify-content: space-between;
//   align-items: center;
// }
// /* ロゴのスタイル */
// .logo {
//   font-size: 24px;
//   font-weight: bold;
//   // text-transform: uppercase;
// }
// /* ナビゲーションメニューのスタイル */
// nav ul {
//   list-style-type: none;
//   margin: 0;
//   padding: 0;
//   display: flex;
// }
// nav ul li {
//   margin-right: 20px;
// }
// nav ul li:last-child {
//   margin-right: 0;
// }
// nav ul li a {
//   color: #fff;
//   text-decoration: none;
//   transition: color 0.3s ease;
// }
// nav ul li a:hover {
//   color: #ccc; /* ナビゲーションメニューのホバー時の色 */
// }
</style>
